# tasks.py

beginner_tasks = {
    "Перевести слово": ["apple", "book", "cat", "dog", "elephant"],
    "Перевести текст": ["Это красное яблоко.", "Мой дом находится рядом с парком.", "Кот играет с мячом."],
    "Дополнить перевод": ["Мой друг купил новую .... (car)", "Я люблю есть печеньки с .... (tea)",
                          "Кот бежит за .... (mouse)", "Я иду в .... (school)"],
}

intermediate_tasks = {
    "Перевести слово": ["computer", "friendship", "travel", "experience", "culture"],
    "Перевести текст": ["Это интересное путешествие.", "Моя культура важна для меня.",
                        "Он имеет много опыта в этой области."],
    "Дополнить перевод": ["Я хочу поехать в путешествие в другую .... (country)",
                          "Он работает в крупной .... (company)", "Я учусь в .... (university)",
                          "Я люблю проводить время с .... (friends)"],
}

advanced_tasks = {
    "Перевести слово": ["sustainability", "innovation", "globalization", "entrepreneurship", "environment"],
    "Перевести текст": ["Инновации играют важную роль в развитии общества.", "Глобализация меняет мир.",
                        "Экологическая устойчивость - ключевой вопрос для будущего планеты."],
    "Дополнить перевод": [".... играют важную роль в развитии общества. (innovation)",
                          ".... меняет мир. (globalization)",
                          "Экологическая .... - ключевой вопрос для будущего планеты. (sustainability)",
                          ".... является движущей силой экономического роста. (entrepreneurship)"],
}

native_speaker_tasks = {
    "Перевести слово": ["serendipity", "onomatopoeia", "defenestration", "lackadaisical", "quintessential"],
    "Перевести текст": ["Эта книга написана с использованием ономатопеи.",
                        "Он проявил характерную легкость в действиях.",
                        "Мой друг подъехал на дорогу."],
    "Дополнить перевод": ["Он проявил характерную .... в действиях. (lackadaisical)",
                          "Мой друг подъехал на .... (driveway)",
                          "Эта книга написана с использованием .... (onomatopoeia)"],
}
